
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11745258459)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories.github_repository_file.pull_request_template[&#34;tfgh&#34;]
  * module.repositories.github_repository_pull_request.managed[&#34;tfgh&#34;]
* Update
  * module.repositories.github_repository_ruleset.this[&#34;tfgh&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories.github_repository_file.pull_request_template["tfgh"] will be created
  + resource "github_repository_file" "pull_request_template" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: pull request template"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Overview :rocket:
            > What is this pull request ?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created ?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "tfgh"
      + sha                             = (known after apply)
    }

  # module.repositories.github_repository_pull_request.managed["tfgh"] will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "main"
      + base_repository       = "tfgh"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - pull request template
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories.github_repository_ruleset.this["tfgh"] will be updated in-place
  ~ resource "github_repository_ruleset" "this" {
        id          = "2549230"
        name        = "default"
        # (6 unchanged attributes hidden)

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":31,"Program":"tfcmt","SHA1":"c4c041b43367022c6383933e3fcf9d9c9f66e316","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->